#1-b
#2-b
#3-b
#4-a
#5-c
#6-a
#7-1-c
#7-2-c
#8-c
#9-a
#10-d
#11-b
#12-b
#13-массив
# - Массив
#   - Нэг төрлийн элементүүдийг хадгалах, тогтмол хэмжээтэй, дараалсан санах ойд  хадгалагддаг.
#   - Элементүүдийг индексээр хандаж болно .Хэмжээг нь тодорхойлох шаардлагатай, нэгэнт тодорхойлсон бол өөрчлөх боломжгүй (нэг удаа тодорхойлсон хэмжээ).
#   Тогтмол хэмжээтэй, зарим тохиолдолд их хэмжээний санах ойг эзэлж болно.
  

#  Холбогдсон жагсаалт
#   - Элементүүдийг холбосон, динамик хэмжээтэй, санах ойд дараалалгүй хадгалагддаг.
#   - Бүх элемент нь өөрийн дараагийн элементийн хаягийг агуулдаг.Динамик, элементүүдийг нэмэх, устгах үед хэмжээ нь өөрчлөгддөг.
#   Нод бүр нь нэмэлт хаяг  агуулдаг, энэ нь илүү их санах ой зарцуулж болно









#14-
# Стек 
#   - Элементүүдийг LIFO (Last In, First Out) зарчмаар хадгалдаг. Энэ нь хамгийн сүүлд нэмэгдсэн элемент хамгийн түрүүнд устгагддаг гэсэн үг.
#   - Стек нь зөвхөн дээд хэсэгт (top) элемент нэмэх, устгах боломжтой.

# - Мод 
#   - Элементүүдийг (нодууд) иерархийн бүтэцтэй хадгалдаг. Нэг элемент (нэгж) нь олон элемент (нодууд) агуулж болно.
#   - Модны үндэс (root) элементээс эхлээд хүүхдүүд (children) болон эцэг (parent) элементүүдтэй холбогдсон.
#15-c
#16-a
#17-b
#18-c



####bodolt
# def greedy_coin_change(tugrug):
#     zoos = [25, 10, 5, 1]
#     coin_count = {}
    
#     for coin in zoos:
#         count = tugrug // coin
#         if count > 0:
#             coin_count[coin] = count
#             tugrug -= count * coin
            
#     return coin_count


# x= greedy_coin_change(67)
# print(x)
#1-c

#2-b
#4-b
#3-c